# GetSizeCount Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTraySizes..::..GetSizeCount Method
CableTraySizes Class See Also
---
Gets the size count of the cable tray size table.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int GetSizeCount()
```

Visual Basic
---
```text
Public Function GetSizeCount As Integer
```

Visual C++
---
```text
public:
int GetSizeCount()
```

# See Also
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace